Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: (Former Editor in Chief of Wired magazine and author of “The Long Tail”)
ja: （ワイアード マガジン 前編集長、「ロング テール」著者）

source: (Initial compliance, also called baseline compliance, happens when development starts, and goes until the release of the first version of the product.) Incremental compliance requires a comparatively small effort in comparison to the efforts involved in establishing baseline compliance.
ja: （ベースライン コンプライアンスとも呼ばれる、初期コンプライアンスは、開発が開始された時に発生し、製品の初期版が出荷されるまで継続します。）インクリメンタル コンプライアンスは、ベースライン コンプライアンスを確立するために必要とする努力と比べると小さな努力ですみます。

source: (This assumes companies rely on specific workflow implemented in tools such as Bugzilla to track compliance of SW components.)
ja: （企業がBugzillaのようなツールに埋め込まれているワークフローを使ってソフトウェア コンポーネントを追跡していると仮定）

source: (both in Computer Science) at the Lebanese American University.
ja: （ともに計算機科学）をLebanese American Universityで取得しています。

source: 39% plan to launch their own open source projects.
ja: 39%が、自社のオープン ソース プロジェクトを立ち上げています。

source: 64% currently participate in open source projects.
ja: 64%が、現在、オープン ソース プロジェクトに参加しています。

source: 78% of surveyed companies run their businesses on open source.
ja: 調査した企業の78%は、オープン ソース上でビジネスを運用しています。

source: A CHANGING BUSINESS ENVIRONMENT
ja: 変わりゆくビジネス環境

source: A CHANGING BUSINESS ENVIRONMENT Traditionally, platforms and software stacks were implemented using proprietary software, and consisted of various software building blocks that originated as a result of internal development or via third-party software providers with negotiated licensing terms.
ja: 変わりゆくビジネス環境 従来、プラットフォームやソフトウェアスタックはプロプラエタリなソフトウェアを使って実装され、内部開発されたソフトや交渉の結果であるライセンス条件によるサードパーティのソフトから成る様々なソフトウェアのブロックから構成されていました。

source: A CHANGING BUSINESS ENVIRONMENT 16
ja: 変わりゆくビジネス環境 16

source: A basic example of a written offer would look as such:
ja: 書面告知の基本的な例は下記のようになります。

source: A best practice in this area is to mandate that third-party software providers disclose any open source used in their offering, along with a statement on how they plan to meet the applicable open source license obligations.
ja: この分野での最も良い方法は、サードパーティのソフトウェアプロバイダに彼らが提供する品についてのオープンソースすべてを開示するよう命令し、またオープンソース上の義務を満たす計画を表明させることです。

source: A bill of material (BOM) difference tool to identify the changes introduced to the BOM of any given product given two different builds.
ja: 部品表 (bill of material, BOM) 差分ツール、二つの異なるビルドでの部品表の違いを特定。

source: A company-wide open source newsletter, usually sent every other month or on quarterly basis, to raise awareness of open source compliance
ja: 企業全体に向けたオープンソースのニュースレター。一般に隔月か四半期ごとに、オープンソースのコンプライアンスについて注意喚起

source: A compliance program is of no value unless it is enforced.
ja: コンプライアンス プログラムは、守られなければ無意味です。

source: A compliance project management tool to manage the compliance project and track tasks and resources.
ja: コンプライアンス プロジェクト管理ツール、コンプライアンス プロジェクトを管理し、タスクやリソースを追跡

source: A compliance record is created (or updated) for the open source .
ja: コンプライアンス記録は、オープン ソースに対して生成（更新）されます。

source: A consistent interdepartmental approach helps with recordkeeping, and also facilitates sharing code across groups.
ja: 部門間での一貫したアプローチは、記録の保持、グループ間でのコードの共有促進と並び有用です。

source: A copyright notice is an identifier placed on copies of the work to inform the world of copyright ownership.
ja: 著作権表示は、ソフトウェアのコピーにつけられる識別情報で、著作権者を示します。

source: A healthy compliance program can deliver major benefits when working with external communities as well.
ja: 健全なコンプライアンスのプログラムは外部コミュニティと協業する上でも大いに有用です。

source: A license notice is a file that includes the open source license text included in the product or stack and is typically provided with product documentation and/or within the product or application user interface.
ja: ライセンス表示とは、製品やスタックに含まれるオープンソースのライセンス文書を含んだファイルで、多くの場合、製品の文書と共に、あるいは製品やアプリケーションのUIと共に提供されます。

source: A link to the project site
ja: プロジェクト サイトへのリンク

source: A linkage analysis tool to identify the interactions of any given C/C++ software component with other software components used in the product.
ja: リンク解析ツール、問題となるC/C++ソフトウェアコンポーネントと、製品に含まれる他のソフトウェア コンポーネントとの関係を特定。

source: A major change in the design or implementation often impacts architecture, APIs, and use cases, and in some cases may have an impact on the compliance aspect.
ja: 設計や実装での大きな変更は、アーキテクチャー、API、ユースケースにインパクトを与えますし、ある場合にはコンプライアンス面でもインパクトがあります。

source: A modification notice calls out modifications to the source code in a change log file, such as those required by the GPL and LGPL.
ja: 変更表示とは、ソースコードに対する変更をチェンジログ内で表示する、GPLやLGPLで必要になるものです。

source: A more complex example would be a software component that includes proprietary source code, source code licensed under License-A, source code that is available under License-B, and source code available under License-C.
ja: より複雑な例としては、プロプライエタリ ソース コード、ライセンスAで許諾されているがライセンスBでも許諾可能なソース コード、ライセンスCで許諾されたソース コードが含まれるものがあります。

source: A new proprietary software component entering the build system where engineering may or may not have borrowed open source code and used it in a proprietary software component
ja: 技術者がオープン ソース コードを模倣しているかもしれないし、プロプライエタリ ソフトウェアにオープン ソース コード使っているかもしれないようなビルドシステムに、入ってくる新しいプロプライエタリ ソフトウェア コンポーネント。

source: A periodically scheduled full-platform scan: Such scans are very useful to uncover open source that may have snuck into your software platform without an OSRB form.
ja: 定期的に計画された全プラットフォーム スキャン：こうしたスキャンは、ソフトウェア プラットフォームにOSRBフォーム無しで忍び込んでいるかもしれないオープン ソースを明らかにするのに非常に役に立ちます。

source: A practice that has proved to be effective in helping companies face these four challenges is to include open source and compliance metrics as part of employee performance reviews.
ja: これらの4つの挑戦に直面した企業をサポートするのに効果的であったプラクティスは、従業員の実績評価の一部としてオープン ソースとコンプライアンス評価項目を含めることです。

source: A project management tool is essential to managing and tracking compliance activities.
ja: プロジェクト管理ツールは、コンプライアンス活動を管理し追跡するのに不可欠なものです。

source: A proper compliance record (also called a ticket) is created capturing all necessary information about the usage of that specific open source and providing the location of the source code within the internal build system.
ja: 適切なコンプライアンス記録（チケットとも呼ばれます）は、特定のオープン ソース利用に関する全ての必要な情報を補足し、内部ビルドシステム内のソース コードの場所を提供するように、作成されます。

source: A request from a developer to use an open source component
ja: 開発者からのオープン ソース コンポーネント利用の要求.

source: A request from a developer to use an open source component .
ja: 開発者からのオープン ソース コンポーネント利用の要求.

source: A request to use open source: This is the most common method for identifying the usage of open source in a product.
ja: オープン ソース利用の要求：これは、製品中のオープン ソース利用を特定する最も普通の方法です。

source: A requirement to distribute proprietary source code that corresponds to the binaries in question under an open source license (depending on the specific case)
ja: 問題のバイナリコードに関わるプロプラエタリなソースコードを（ケースに応じた）オープンソース ライセンスで配布するよう要求される

source: A requirement to distribute proprietary source code that corresponds to the binaries in question under an open source license (depending on the specific case) .
ja: 問題のバイナリコードに関わるプロプラエタリなソースコードを（ケースに応じた）オープンソースライセンスで配布するよう要求されます

source: A resolution for each of the flagged files in the report and a resolution for any flagged license conflict.
ja: 報告にあるフラグ付きのファイルの解決と、フラグ付きのライセンス矛盾の解決

source: A sample compliance usage process
ja: コンプライアンス利用プロセスの例

source: A significant re-engineering effort to eliminate the compliance issues
ja: コンプライアンス上の懸念を解消するため多大な工数が費やされる

source: A significant re-engineering effort to eliminate the compliance issues .
ja: コンプライアンス上の懸念を解消するため多大な工数が費やされます

source: A simple how-to for license classifications
ja: ライセンス分類のための簡単なハウツー

source: A simple policy can be as effective as a complex one as long as it mandates the following:
ja: 単純なポリシーでも、以下の項目を要求するものであれば、複雑なポリシーと同じように効果的であることができます。

source: A simplified architecture of a traditional software platform that relies on proprietary software building blocks
ja: プロプラエタリなソフトウェアのブロックに依る従来のソフトウェア プラットフォームの単純化したアーキテクチャ

source: A simplified view of the architecture of a modern software platform, showing the proliferation of open source inside each of the software building blocks.
ja: 現代のソフトウェア プラットフォームの単純化したアーキテクチャ。個々のソフトウェアの構築ブロック内部でオープンソースが増えていることを示している。

source: A single individual, no matter how adept, can’t successfully implement open source compliance across a whole organization.
ja: 一人の個人では、どれほどの達人であろうとも、オープンソース コンプライアンスを組織全体に実装することはできません。

source: A software inventory tool to keep track of every single software component, version, and product that uses it, and other related information.
ja: ソフトウェア インベントリ ツール、個々のソフトウェア コンポーネント、バージョン、それを使用している製品、関連情報を継続的に追跡

source: A source code and license identification tool to help identify the origin and license of the source code included in the build system.
ja: ソースコードとライセンスの識別ツール、ビルドするシステムに含まれるソースコードの由来とライセンスを特定

source: A source code peer review tool to review the changes introduced to the original source code before disclosure as part of meeting license obligations.
ja: ソースコードのピアレビュー（査読）ツール、ライセンス上の義務を満たすための開示に先立ちオリジナルソースコードに対する変更をレビュー。

source: A source code scan of the entire software stack
ja: 全ソフトウェア スタックのソース コード スキャン

source: A source code scan of the entire software stack .
ja: 全ソフトウェア スタックのソース コード スキャン

source: A source code scan report and confirmation that all the issues identified in the scanning phase have been resolved.
ja: ソース コード スキャン報告、スキャン フェーズで発見された課題が全て解決済みであることの確認

source: A source code scan report generated by the scanning tool .
ja: スキャン ツールによって生成されたソース コード スキャン報告

source: A source code svcan has been completed, and an audit report is generated identifying the origins and licenses of the source code.
ja: ソース コード スキャンが完了し、ソース コードの出自とライセンスを特定した監査報告が生成される。

source: A verbatim copy of the copyright notices is required for many open source licenses.
ja: 著作権表記の逐語的コピーが、多くのオープン ソース ライセンスで要求されます。

source: A verbatim copy of the full license text is required for almost all open source licenses.
ja: ライセンス全文の逐語的コピーが、ほとんど全てのオープン ソース ライセンスで要求されます。

source: A well-designed open source compliance process should simultaneously ensure compliance with the terms of open source licenses and also help companies protect their own intellectual property and that of third-party suppliers from unintended disclosure and/or other consequences.
ja: 適切に規定されたオープンソースのコンプライアンスのプロセスは、ライセンス条項の順守を保証すると同時に、企業自身、あるいはサードパーティのサプライヤの知的財産が意図せず公開されたり、その他不適当な結果を招いたりしないように設計されるべきです。

source: A written notice provides the end users of the product with information on open source software included in the product and how to download source code that is eligible to distribution.
ja: 書面での告知は、その製品のエンド ユーザーに対してその製品に含まれるオープンソース ソフトウェアの情報、そして頒布されるべきソースコードをダウンロードする方法を開示します。

source: ABOUT THE AUTHOR
ja: 著者について

source: ACHIEVING COMPLIANCE: ROLES AND RESPONSIBILITIES
ja: コンプライアンス達成に向けて：役割と責任

source: ATTRIBUTION CONSIDERATIONS
ja: 帰属についての考察

source: ATTRIBUTION CONSIDERATIONS 132
ja: 帰属についての考察 132

source: AUDITING
ja: 監査

source: AUDITING 99
ja: 監査 99

source: Accelerate exchange of information and ideas with the project communities of integrated code through sharing of source code modifications .
ja: ソース コード変更の共有を行うことで、統合コードのプロジェクト コミュニティとの間で、情報やアイディアの交換が加速されます。

source: Access to source code for an undisclosed component that was discovered in a product
ja: 製品内にあることがわかったが、開示されていないコンポーネントに関するソース コードへのアクセス

source: Access to source code for an undisclosed component that was discovered in a product .
ja: 製品内にあることがわかったが、開示されていないコンポーネントに関するソース コードへのアクセス

source: Access to source code in accordance with a written offer to provide source code licensed under GPL, LGPL, or other licenses
ja: GPL, LGPLやその他のライセンスで許諾されたソース コードを提供するという文書通知に従って行われる、ソース コードへのアクセス

source: Access to source code in accordance with a written offer to provide source code licensed under GPL, LGPL, or other licenses .
ja: GPL, LGPLやその他のライセンスで許諾されたソース コードを提供するという文書通知に従って行われる、ソース コードへのアクセス

source: Achieving compliance requires the proper policies and processes, training, tools, and proper staffing that enable an organization to effectively use open source and contribute to open source projects and communities, all while respecting copyrights of their respective holders, complying with license obligations, and protecting the organization’s intellectual property and that of its customers and suppliers.
ja: コンプライアンスを達成するためには、適切なポリシーやプロセス、トレーニング、ツール、著作権者の著作権を尊重し、ライセンス義務を遵守し、組織や顧客や供給者の知的財産を守りながら、オープン ソースを効果的に利用しオープン ソース プロジェクトやコミュニティに貢献する体制が構築できる適切な担当者の配置などが必要です。

source: Achieving consistency across the company is key in large companies with multiple business units and subsidiaries.
ja: 企業全体で一貫性を保つことは複数のビジネス ユニットや子会社を持つ大企業では重要です。

source: Acknowledge
ja: 確認

source: Acknowledge 122
ja: 確認 122

source: Acknowledge the use of open source by providing full copyright and attribution notices.
ja: 著作権や帰属を全て通知することで、オープン ソースを利用していることを知らせます。

source: Acknowledge the use of open source by providing required copyright and attribution notices
ja: 必要な著作権や帰属を通知することで、オープン ソースを利用していることを知らせます。.

source: Acknowledge the use of open source by providing required copyright and attribution notices .
ja: 必要な著作権や帰属を通知することで、オープン ソースを利用していることを知らせます。.

source: Acknowledgments Notices
ja: 謝辞表記

source: Act as liaison between OSEC and OSRB
ja: OSECとORSBの間の連絡役となります。

source: Act as liaison between OSEC and OSRB .
ja: OSECとORSBの間の連絡役となります。

source: Act as liaison between the engineering and product team and the OSRB and OSEC in regard to usage plan approval processes
ja: オープンソースの利用申請書類の承認について、エンジニアリングおよび製品チームとOSRB、OSECの連絡役となります。

source: Act as liaison between the engineering and product team and the OSRB and OSEC in regard to usage plan approval processes .
ja: オープンソースの利用申請書類の承認について、エンジニアリングおよび製品チームとOSRB、OSECの連絡役となります。

source: Action
ja: 行動

source: Add a verification step into the compliance process to ensure that you’re publishing the version of source code that exactly corresponds to the distributed binary version
ja: 検証作業をコンプライアンスプロセスに追加し、提供するソースコードのバージョンが、出荷される バイナリのバージョンと確かに正確に対応することを確認

source: Add milestone in compliance process to verify modified source code has been marked as such
ja: 変更されたソースコードが適切にマークされていることを、コンプライアンス プロセス上のマイルストーンとする

source: Add source code marking as checklist item before releasing source code to ensure you flag all the source code introduced to the original copy you downloaded
ja: ソースコードへのマーク付けをソースコードのリリース前のチェックリストに加え、ダウンロードしたオリジナルのコピーとの差分すべてに確実にマーク

source: Add the “compute diffs” of any modified source code (eligible for open source distribution) to the checklist item before releasing open source used in the product
ja: 「diffの計算」を変更された(オープンソースとするにふさわしい) ソースコードのチェックリストに加え 、製品に使われたオープンソースのリリース前に行う

source: Address all the hits, possible matches, and licensing conflicts flagged by the scanning tool .
ja: スキャンのツールで発見されたコード合致 、潜在的な合致、ライセンスの衝突を識別 .

source: Adherence to the company’s compliance policy and process, in addition to any provided guidelines .
ja: 企業のコンプライアンスポリシーとプロセス、加えてあらゆるガイドラインの厳守

source: Advise on IP issues associated with the use of open source.
ja: オープンソースの利用に伴う知財権について助言します。

source: Advise on licensing conflicts arising from incompatible or conflicting licenses primarily based on company policy, which is some cases rely on external factors such as legal opinions of relevant open source organizations.
ja: 互換性がなかったり、衝突するライセンスに由来するライセンスの衝突について第一に企業のポリシーに基づいて助言を行います。これは時として関連するオープンソースの組織の法律上の意見表明になど外部条件に依ることもあります。

source: Advise on open source licensing
ja: オープンソースのライセンスについて助言

source: Advise on open source licensing .
ja: オープンソースのライセンスについて助言

source: After Motorola, he ran the Open Source function at Palm as Director of Open Source responsible for the webOS open source strategy and compliance.
ja: Motorolaを離れた後、彼は、Palmにおいて、webOS オープン ソース戦略とコンプライアンスに責任を持つオープン ソース担当役員としてオープン ソース部門を指揮しました。

source: After concluding the internal investigation within an acceptable period of time, and creating an internal record of the findings, you need to inform the inquirer of the results.
ja: 許容できる期間内で内部調査の結論を出して発見された事項を内部記録に残した後、照会者に結果を伝える必要があります。

source: Agreements relating to outsourced development of software should also be updated to reflect compliance procedures and to ensure that other provisions of these agreements (such as representations and warranties) are broad enough to cover the risks posed by open source.
ja: ソフトウェア開発の外部委託の合意文書も、コンプライアンス手続きを反映し、またその他の条項（表示や保証など）がオープンソースによるリスクを広く含むよう改める必要があります。

source: All OSRB members have reviewed the compliance ticket, and the OSRB has completed the architecture review and linkage analysis.
ja: 全てのOSRBメンバーはコンプライアンス チケットをレビューし、OSRBはアーキテクチャー レビューとリンク解析を完了している。

source: All changed components must go through the approval process.
ja: 全ての変更されたコンポーネントは、承認プロセスを通過しなければなりません。

source: All compliance tickets are clear of any unresolved subtasks attached to them.
ja: 全てのコンプライアンス チケットは、付属している未解決サブタスクがクリアされています。

source: All compliance tickets have been approved by engineering and legal.
ja: 全てのコンプライアンス チケットは、技術担当と法務担当に承認されています。

source: All copyright and licensing information is to remain intact in all open source components.
ja: 全ての著作権とライセンス情報は、全てのオープン ソース コンポーネントの中で触らずそのまま残しておく必要があります。

source: All copyright and licensing information must remain intact in all open source components, unless you are completely certain the license allows it to be changed.
ja: 全ての著作権やライセンスの情報は、ライセンスが変更を許していると完全に確信できるとき以外は、オープン ソース コンポーネントでそのままの状態にしておきます。

source: All facets of the company must be involved in ensuring proper compliance and contributing to correct open source consumption and, when necessary, redistribution.
ja: 全部門が関わって適切なコンプライアンス、正しいオープンソースの利用、必要に応じた再配布、を確実に行う必要があります。

source: All modifications to open source code modules shall be captured in the revision history of the module (change log file).
ja: オープン ソース モジュールへの全ての変更は、モジュールの修正履歴（変更ログファイル）で把握されるようにします。

source: All obligations related to the use of licensed material have been identified .
ja: ライセンスされたものの利用に関する全ての義務は、特定されている。

source: All personnel involved with software need to understand the company’s policies and procedures.
ja: ソフトウェアに関わる全職員が企業のポリシーとプロセスを理解する必要があります。

source: All pre-distribution verifications have been checked and no issue is discovered.
ja: 全ての頒布前検証がチェックされ、問題が発見されていない。

source: All software must be audited and reviewed, including proprietary software components, software received from third-party providers, and open source software.
ja: 全てのソフトウェアは、監査とレビューを受ける必要があります。これにはプロプライエタリ ソフトウェア、サード パーティ プロバイダーから受け取ったソフトウェア、そしてオープン ソース ソフトウェアを含みます。

source: All source code comments have been reviewed and any offending or inappropriate content has been removed.
ja: 全てのソース コード コメントはレビューされ、不適切な内容は取り除かれている。

source: All source code components have a corresponding compliance ticket.
ja: 全てのソース コード コンポーネントは、対応するコンプライアンス チケットを持っています。

source: Also, note that linkages may not always be reciprocal between licenses.
ja: また、リンクは、ライセンス間で常に相互に成り立つとは限らないに注意して下さい。

source: Alternatively, if you prefer receiving requests via email and not via postal mail, the wording of the written offer would change slightly to:
ja: 代替手段として、郵便ではなくemailにて要求を受けたいならば、書面による通知の文言を少し変更します。

source: Alternatives to using the component/package
ja: コンポーネントやパッケージとは別の手段

source: Although this is not compliance-related, there have been issues in the past related to future product code-names used, obscene or vulgar language, and references to individuals, email addresses, and/or internal URLs left in the code.
ja: このことはコンプライアンス関連ではないですが、将来使用予定の製品コード名、下品または粗野な言葉づかい、個人やemailアドレスやURLへの参照などがコードに残されたままであったというような課題が過去にありました。

source: Always audit source code upon receipt from providers; alternatively, make it a company policy that software providers must deliver source code audit reports for code they supply.
ja: 供給者から受け取る時に、いつもソースコードを監査します。代わりの方法としては、ソフトウェア供給者が供給するコードの監査報告を必ず提供しなければならないという企業ポリシーを制定します。

source: Always highlight your open source compliance practices and demonstrate historical good faith efforts toward compliance.
ja: 常に、自分たちのオープン ソース コンプライアンス プラクティスを示し、コンプライアンスに対する長年の誠実な取り組みを行動によって示します。

source: An attribution notice is usually provided as a text file together with the open source component that provides acknowledgement as supplied by the contributors of open source components.
ja: 帰属表示は通常、テキストファイルとしてオープンソースのコンポーネントと共に提供され、オープンソース コンポーネントへのコントリビューターが提供したことを示します。

source: An audit is requested to scan the source code
ja: ソース コードをスキャンするように、監査が要求されます。

source: An audit report identifying the origins and licenses of the source code
ja: ソース コードの出自とライセンスを特定する監査報告

source: An audit report identifying the origins and licenses of the source code .
ja: ソース コードの出自とライセンスを特定する監査報告.

source: An effective compliance program should include mechanisms for ongoing monitoring of adherence to the program and for enforcing policies, procedures, and guidelines throughout the organization.
ja: 効果を持たせるため、コンプライアンスプログラムにはプログラム厳守を監視し、ポリシーやプロセスやガイドラインを全社的に守らせる メカニズムを含めるべきです。

source: An example matrix is provided in Table 7.
ja: マトリックスの例を、表7に示します。

source: An example of a modification notice is shown below:
ja: 一例を下記に示します。

source: An example of license compatibility is combining code licensed under the X11 license, which is explicitly compatible with the GPL version 2.
ja: ライセンス両立性の例は、明らかにGPL version 2と両立できる、X11ライセンスのコードを結合する時に見られます。

source: An example of licensing incompatibility can be found in attempting to combine code distributed under the Apache version 2 license with software under the GNU GPL version 2.0 (due to patent termination and indemnification provisions not present in the older GPL license ).
ja: 両立しないライセンスの例は、Apache version 2ライセンスで頒布されたコードをGNU GPL version 2の（古いGPLライセンスには存在していなかった特許終了と免責に関する事項によって）ソフトウェアと結合しようとするときに見られます。

source: An example of this option is a cell phone or a tablet.
ja: この選択肢の例は、携帯電話やタブレットです。

source: An incoming OSRB form requesting using a specific open source .
ja: 特定のオープン ソース利用を要求する入るOSRBフォーム

source: An incoming OSRB usage form, usually filled out by engineering staff.
ja: 通常、技術スタッフによって記入されるOSRB利用フォームの到着。

source: An injunction preventing a company from shipping a product until source code is released.
ja: ソースコードが開示されるまで製品出荷を差し止める命令

source: An injunction preventing a company from shipping the product until the compliance issue has been resolved
ja: 差し止め命令によりコンプライアンス上の懸念が解決されるまで製品が出荷できない

source: An injunction preventing a company from shipping the product until the compliance issue has been resolved .
ja: 差し止め命令によりコンプライアンス上の懸念が解決されるまで製品が出荷できない

source: An internal open source portal to host the company’s compliance policies and procedures, open source related publications and presentations, mailing lists, and a discussion forum related to open source and compliance .
ja: 内部的なポータルを作り、企業のコンプライアンス ポリシーやプロセス、オープンソースに関係した出版物やプレゼンテーション、メーリングリスト、オープンソースとコンプライアンスに関係する討論フォーラムをホスト

source: An open source management program provides a structure around all aspects of open source software, including selection, approval, use, distribution, audit, inventory, training, community engagement, and public communication.
ja: オープンソース管理プログラムはオープンソース ソフトウェアの全ての側面、その選択、承認、利用、頒布、監査、インベントリ、訓練、コミュニティとの関わり、広報等々の体系を定めます。

source: Analyze the results provided by the scanning tool
ja: スキャンするツールの結果を分析

source: Analyze the results provided by the scanning tool .
ja: スキャンするツールの結果を分析

source: And additional validation is required after source code becomes publicly available.
ja: 更に、追加の正当性確認は、一般に入手可能になった後にも必要になります。

source: Another example would be a software component with a mix of proprietary source code and source code licensed under the GPL.
ja: 他の例としては、プロプライエタリ ソース コードとGPLで許諾されたソース コードとが組み合わされたものがあります。

source: Another important reason to perform a linguistic review is to ensure that the source code and comments do not make reference to future product code names or capabilities.
ja: リンギスティック レビューを実施する他の重要な理由は、ソース コードやコメントが、将来使用する開発コード名や機能を言及していないことを確実にすることです。
